Ran Plan for 2 projects:

1. project: `vpc-dev` dir: `vpc` workspace: `default`
1. project: `vpc-production` dir: `vpc` workspace: `default`

### 1. project: `vpc-dev` dir: `vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_internet_gateway.int_gw has been deleted
- resource "aws_internet_gateway" "int_gw" {
      - id       = "igw-005d4980e3dc48a75" -> null
        tags     = {
            "Name"        = "Production-igw"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.database has been deleted
- resource "aws_route_table" "database" {
      - id               = "rtb-01613030bdfd55a2c" -> null
        tags             = {
            "Name"        = "Production-database-route"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.private has been deleted
- resource "aws_route_table" "private" {
      - id               = "rtb-0f720c9a5e52c3a80" -> null
        tags             = {
            "Name"        = "Production-private-route"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.public has been deleted
- resource "aws_route_table" "public" {
      - id               = "rtb-05d04d3f61985ed1f" -> null
        tags             = {
            "Name"        = "Production-public-route"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_subnet.db1 has been deleted
- resource "aws_subnet" "db1" {
      - id                                             = "subnet-0ee7376c38c25baa9" -> null
        tags                                           = {
            "Name"        = "Production-db1"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_subnet.db2 has been deleted
- resource "aws_subnet" "db2" {
      - id                                             = "subnet-04b6f5276d0c6a5b3" -> null
        tags                                           = {
            "Name"        = "Production-db2"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_subnet.priv_1 has been deleted
- resource "aws_subnet" "priv_1" {
      - id                                             = "subnet-08ae72ae532c56062" -> null
        tags                                           = {
            "Name"        = "Production-priv_1"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_subnet.priv_2 has been deleted
- resource "aws_subnet" "priv_2" {
      - id                                             = "subnet-0417b15f0c33f531a" -> null
        tags                                           = {
            "Name"        = "Production-priv_2"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_subnet.pub_1 has been deleted
- resource "aws_subnet" "pub_1" {
      - id                                             = "subnet-09a9b311ab05d87dd" -> null
        tags                                           = {
            "Name"        = "Production-pub_1"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_subnet.pub_2 has been deleted
- resource "aws_subnet" "pub_2" {
      - id                                             = "subnet-0a602f9159b2058a0" -> null
        tags                                           = {
            "Name"        = "Production-pub_2"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_vpc.vpc has been deleted
- resource "aws_vpc" "vpc" {
      - id                                   = "vpc-06f11ef0c09eb547f" -> null
        tags                                 = {
            "Name"        = "Production-vpc"
            "environment" = "Production"
            "location"    = "USA"
            "project"     = "Fox"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.int_gw will be created
+ resource "aws_internet_gateway" "int_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Development-igw"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all = {
          + "Name"        = "Development-igw"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public_default will be created
+ resource "aws_route" "public_default" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.database will be created
+ resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Development-database-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Development-database-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Development-private-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Development-private-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Development-public-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all         = {
          + "Name"        = "Development-public-route"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.database1 will be created
+ resource "aws_route_table_association" "database1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.database2 will be created
+ resource "aws_route_table_association" "database2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet1_association will be created
+ resource "aws_route_table_association" "private_subnet1_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet2_association will be created
+ resource "aws_route_table_association" "private_subnet2_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnet1_association will be created
+ resource "aws_route_table_association" "public_subnet1_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnet2_association will be created
+ resource "aws_route_table_association" "public_subnet2_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.db1 will be created
+ resource "aws_subnet" "db1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-db1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-db1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.db2 will be created
+ resource "aws_subnet" "db2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-db2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-db2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv_1 will be created
+ resource "aws_subnet" "priv_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-priv_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-priv_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.priv_2 will be created
+ resource "aws_subnet" "priv_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-priv_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-priv_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub_1 will be created
+ resource "aws_subnet" "pub_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-pub_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-pub_1"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.pub_2 will be created
+ resource "aws_subnet" "pub_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "Development-pub_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                                       = {
          + "Name"        = "Development-pub_2"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "Development-vpc"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
      + tags_all                             = {
          + "Name"        = "Development-vpc"
          + "environment" = "Development"
          + "location"    = "Cardiff"
          + "project"     = "Fox"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.alexmelidevops.cloud/lock?id=jalexkam%252Fbasic-terraform%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc-dev`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 18 to add, 0 to change, 0 to destroy.

---
### 2. project: `vpc-production` dir: `vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.17.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m

[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1maws_vpc.vpc: Refreshing state... [id=vpc-06f11ef0c09eb547f][0m
[0m[1mdata.aws_availability_zones.available: Read complete after 0s [id=us-east-1][0m
[0m[1maws_subnet.db1: Refreshing state... [id=subnet-0ee7376c38c25baa9][0m
[0m[1maws_subnet.db2: Refreshing state... [id=subnet-04b6f5276d0c6a5b3][0m
[0m[1maws_route_table.database: Refreshing state... [id=rtb-01613030bdfd55a2c][0m
[0m[1maws_subnet.pub_2: Refreshing state... [id=subnet-0a602f9159b2058a0][0m
[0m[1maws_subnet.priv_1: Refreshing state... [id=subnet-08ae72ae532c56062][0m
[0m[1maws_subnet.pub_1: Refreshing state... [id=subnet-09a9b311ab05d87dd][0m
[0m[1maws_subnet.priv_2: Refreshing state... [id=subnet-0417b15f0c33f531a][0m
[0m[1maws_internet_gateway.int_gw: Refreshing state... [id=igw-005d4980e3dc48a75][0m
[0m[1maws_route_table.private: Refreshing state... [id=rtb-0f720c9a5e52c3a80][0m
[0m[1maws_route_table.public: Refreshing state... [id=rtb-05d04d3f61985ed1f][0m
[0m[1maws_route_table_association.private_subnet2_association: Refreshing state... [id=rtbassoc-0acf12bc5a88f4e62][0m
[0m[1maws_route.public_default: Refreshing state... [id=r-rtb-05d04d3f61985ed1f1080289494][0m
[0m[1maws_route_table_association.public_subnet1_association: Refreshing state... [id=rtbassoc-069db4c34831ff961][0m
[0m[1maws_route_table_association.database2: Refreshing state... [id=rtbassoc-08fc7dde75c17fc17][0m
[0m[1maws_route_table_association.public_subnet2_association: Refreshing state... [id=rtbassoc-0df9283bd5df0294c][0m
[0m[1maws_route_table_association.private_subnet1_association: Refreshing state... [id=rtbassoc-089d76d209685d8b6][0m
[0m[1maws_route_table_association.database1: Refreshing state... [id=rtbassoc-0bf4e3fa5eef27d5f][0m

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc-production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.alexmelidevops.cloud/lock?id=jalexkam%252Fbasic-terraform%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc-production`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
